In [1]:
import numpy as np
import pandas as pd

In [2]:
# https://jalammar.github.io/gentle-visual-intro-to-data-analysis-python-pandas/

# Series

In [3]:
# Tek boyutludur
names = ["Ensar","Erva","Muhammed"]
notes = [70,60,65]

In [4]:
result=pd.Series(data=notes, index=names)
print(result)

Ensar       70
Erva        60
Muhammed    65
dtype: int64

In [5]:
notes2 = [10,20,30]
result2=pd.Series(data=notes2, index=names)
print(result2)

Ensar       10
Erva        20
Muhammed    30
dtype: int64

In [6]:
print(result+result2)
print()
print(result-result2)

Ensar       80
Erva        80
Muhammed    95
dtype: int64

Ensar       60
Erva        40
Muhammed    35
dtype: int64

# DataFrame

In [7]:
data = np.random.randn(4,3)
data

array([[-0.42789511, -0.17271996,  0.05815153],
       [ 1.19168951, -0.34134856, -0.46437169],
       [ 1.93568313,  0.31273275,  1.61430152],
       [-0.75071186,  0.40131685, -0.86882182]])

In [8]:
data_frame = pd.DataFrame(data)
data_frame

          0         1         2
0 -0.427895 -0.172720  0.058152
1  1.191690 -0.341349 -0.464372
2  1.935683  0.312733  1.614302
3 -0.750712  0.401317 -0.868822

In [9]:
print(type(data_frame))
print(type(data_frame[0]))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [10]:
new_data_frame = pd.DataFrame(data, index=["Ensar","Erva","Zümra","Hilal"], columns=["Maaş", "Yaş","Tecrübe"])
new_data_frame

           Maaş       Yaş   Tecrübe
Ensar -0.427895 -0.172720  0.058152
Erva   1.191690 -0.341349 -0.464372
Zümra  1.935683  0.312733  1.614302
Hilal -0.750712  0.401317 -0.868822

In [11]:
new_data_frame.iloc[0] # satıra göre arama yapma --> loc[Ensar] da aynısını verir

Maaş      -0.427895
Yaş       -0.172720
Tecrübe    0.058152
Name: Ensar, dtype: float64

# Data Manipulation

In [12]:
new_data_frame["Ekstra"]=10
new_data_frame

           Maaş       Yaş   Tecrübe  Ekstra
Ensar -0.427895 -0.172720  0.058152      10
Erva   1.191690 -0.341349 -0.464372      10
Zümra  1.935683  0.312733  1.614302      10
Hilal -0.750712  0.401317 -0.868822      10

In [13]:
new_data_frame.drop("Ekstra", axis=1, inplace=True) # inplace içinde bunu yap , axis=1 demezsen satırı siler
new_data_frame                                      # new_data_frame = new_data_frame.drop("Ekstra",axis=1) de denebilir.

           Maaş       Yaş   Tecrübe
Ensar -0.427895 -0.172720  0.058152
Erva   1.191690 -0.341349 -0.464372
Zümra  1.935683  0.312733  1.614302
Hilal -0.750712  0.401317 -0.868822

In [14]:
new_data_frame.loc["Ensar","Maaş"]=100
new_data_frame

             Maaş       Yaş   Tecrübe
Ensar  100.000000 -0.172720  0.058152
Erva     1.191690 -0.341349 -0.464372
Zümra    1.935683  0.312733  1.614302
Hilal   -0.750712  0.401317 -0.868822

In [15]:
print(new_data_frame[new_data_frame>0])
print()
print(new_data_frame[new_data_frame["Yaş"]>0])

             Maaş       Yaş   Tecrübe
Ensar  100.000000       NaN  0.058152
Erva     1.191690       NaN       NaN
Zümra    1.935683  0.312733  1.614302
Hilal         NaN  0.401317       NaN

           Maaş       Yaş   Tecrübe
Zümra  1.935683  0.312733  1.614302
Hilal -0.750712  0.401317 -0.868822

# Read Excel & CSV

In [16]:
weather_df = pd.read_excel('6-weather.xlsx')
weather_df

   Istanbul  New York  Amsterdam  Paris
0        20        10         15     12
1        21        10         17     14
2        20        13         18     15
3        22        14         19     18
4        25        15         15     20
5        28        13         22     16
6        15        12         15     15
7        20        15         14     14
8        22        16         16     16

In [17]:
print(weather_df.head())
print()
print(weather_df.tail())

   Istanbul  New York  Amsterdam  Paris
0        20        10         15     12
1        21        10         17     14
2        20        13         18     15
3        22        14         19     18
4        25        15         15     20

   Istanbul  New York  Amsterdam  Paris
4        25        15         15     20
5        28        13         22     16
6        15        12         15     15
7        20        15         14     14
8        22        16         16     16

In [18]:
weather_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Istanbul   9 non-null      int64
 1   New York   9 non-null      int64
 2   Amsterdam  9 non-null      int64
 3   Paris      9 non-null      int64
dtypes: int64(4)
memory usage: 420.0 bytes

In [19]:
weather_df.describe()

        Istanbul   New York  Amsterdam      Paris
count   9.000000   9.000000   9.000000   9.000000
mean   21.444444  13.111111  16.777778  15.555556
std     3.609401   2.147350   2.538591   2.351123
min    15.000000  10.000000  14.000000  12.000000
25%    20.000000  12.000000  15.000000  14.000000
50%    21.000000  13.000000  16.000000  15.000000
75%    22.000000  15.000000  18.000000  16.000000
max    28.000000  16.000000  22.000000  20.000000

In [20]:
print(weather_df.isna())
print()
print(weather_df.count())

   Istanbul  New York  Amsterdam  Paris
0     False     False      False  False
1     False     False      False  False
2     False     False      False  False
3     False     False      False  False
4     False     False      False  False
5     False     False      False  False
6     False     False      False  False
7     False     False      False  False
8     False     False      False  False

Istanbul     9
New York     9
Amsterdam    9
Paris        9
dtype: int64

# Working With Missing Data

In [21]:
weather_na_df = pd.read_excel('6-weatherna.xlsx')
weather_na_df

   Istanbul  New York  Amsterdam  Paris
0      20.0      10.0       15.0   12.0
1      21.0      10.0        NaN   14.0
2       NaN      13.0       18.0   15.0
3      22.0      14.0       19.0   18.0
4      25.0      15.0       15.0   20.0
5      28.0       NaN       22.0    NaN
6      15.0      12.0       15.0   15.0
7      20.0      15.0       14.0    NaN
8      22.0      16.0       16.0    NaN

In [22]:
print(weather_na_df.dropna())
print()
print(weather_na_df.fillna(20))

   Istanbul  New York  Amsterdam  Paris
0      20.0      10.0       15.0   12.0
3      22.0      14.0       19.0   18.0
4      25.0      15.0       15.0   20.0
6      15.0      12.0       15.0   15.0

   Istanbul  New York  Amsterdam  Paris
0      20.0      10.0       15.0   12.0
1      21.0      10.0       20.0   14.0
2      20.0      13.0       18.0   15.0
3      22.0      14.0       19.0   18.0
4      25.0      15.0       15.0   20.0
5      28.0      20.0       22.0   20.0
6      15.0      12.0       15.0   15.0
7      20.0      15.0       14.0   20.0
8      22.0      16.0       16.0   20.0

In [23]:
print(weather_na_df.mean())
print()
print(weather_na_df.median())

Istanbul     21.625000
New York     13.125000
Amsterdam    16.750000
Paris        15.666667
dtype: float64

Istanbul     21.5
New York     13.5
Amsterdam    15.5
Paris        15.0
dtype: float64

In [24]:
# Ortalama ile doldurma
weather_na_df.fillna(weather_na_df.mean())

   Istanbul  New York  Amsterdam      Paris
0    20.000    10.000      15.00  12.000000
1    21.000    10.000      16.75  14.000000
2    21.625    13.000      18.00  15.000000
3    22.000    14.000      19.00  18.000000
4    25.000    15.000      15.00  20.000000
5    28.000    13.125      22.00  15.666667
6    15.000    12.000      15.00  15.000000
7    20.000    15.000      14.00  15.666667
8    22.000    16.000      16.00  15.666667